<<<<<<< HEAD
#include "task3.h"

int main() {
    setlocale(LC_ALL, "rus");
    int64_t c, m;
    cout << "Введите основание и модуль: ";
    cin >> c >> m;
    cout << "\n" << c << "^(-1) mod " << m << " = d\nИщем обратный элемент\n";

    cout << "\nr - остаток от деления;\nd - коэффициент при " << c << "; v - коэффициент при " << m << "; q - целая часть от деления\n";
    int64_t d = modinv(c, m);
    if (d != -1) {
        cout << "\nd (в строке с последним ненулевым остатком) = " << d << "\n";
        cout << "Проверка: " << c << " * " << d << " mod " << m << " = " << (c * d) % m << "\n";
    }
    return 0;
=======
#include "task3.h"

int main() {
    setlocale(LC_ALL, "rus");
    int64_t c, m;
    cout << "Введите основание и модуль: ";
    cin >> c >> m;
    cout << "\n" << c << "^(-1) mod " << m << " = d\nИщем обратный элемент\n";

    cout << "\nr - остаток от деления;\nd - коэффициент при " << c << "; v - коэффициент при " << m << "; q - целая часть от деления\n";
    int64_t d = modinv(c, m);
    if (d != -1) {
        cout << "\nd (в строке с последним ненулевым остатком) = " << d << "\n";
        cout << "Проверка: " << c << " * " << d << " mod " << m << " = " << (c * d) % m << "\n";
    }
    return 0;
>>>>>>> 05ec7888d741d95755c8845f0090f27b7e6d8528
}